[
	{
		"name": "YWCA Hamilton",
		"date": "3/3/2025",
		"paragraph": "This experience is the perfect combination of personal self-revelation, team dynamics and interactive FUN! If you are looking for a great way to engage your team in a safe, meaningful session that focuses on how to show up and choose how to influence others, then this will be the event for you and your team! We left feeling joy, hope and energized!"
	},
	{
		"name": "Sunderland Fair",
		"date": "3/3/2025",
		"paragraph": "The Escape Rooms were a great addition to our Sunderland Fall Fair. Adults and children thoroughly enjoyed the experience. Rick was great to work with!!"
	},
	{
		"name": "Boo Bash",
		"date": "3/3/2025",
		"paragraph": "For the inaugural Boo Bash, we decided to add an extra special touch by having the Witch’s Hut escape room from Five Nineteen Productions as an activity for the littles in our community - and it did not disappoint! Our only regret is that we didn’t have more than one!!! The line up was constant, for 5 hours! And the entire community raves about how awesome it was to have an escape room that was appropriate for little kids. Our community loved it so much that they’ve asked us to have another 2 or 3 for next year! Thank you Rick for being so incredible to work with. Your passion for what you do is what makes this so epic and we can’t wait to work with you on some extra special things for next year!"
	},
	{
		"name": "Tara K.",
		"date": "3/3/2025",
		"paragraph": "Loved having The Room at my husband's birthday party, our guests had fun trying to solve the puzzle. Highly recommend for team building, parties, you name it. Rick was very professional and accommodating, especially with the cold weather in March! Looking forward to what he has coming up next."
	},
	{
		"name": "McMaster University",
		"date": "2/2/2023",
		"paragraph": "The team was amazing to work with from start to finish. Very reasonable prices for a fun event. Staff were amazing and very personable! Would recommend for an on campus or work related event!"
	}
]
